# Core tools
brew "bob"  # neovim version manager
brew "tmux"
brew "stow"

# Shell utilities
brew "fzf"
brew "bat"
brew "zoxide"
brew "neofetch"
brew "keychain"
brew "lazygit"
brew "jq"
# sshfs requires macFUSE kernel extension on macOS - install manually if needed
# Linux: installed via setup.sh

# Languages
brew "go"
brew "rust"
brew "node"
brew "python"

# Build tools (for nvim plugins)
brew "cmake"
brew "make"

# Apps
cask "alacritty"
cask "font-hack-nerd-font", args: { force: true }
